app/Http/Controllers/dashboardController.php

    public function indexstaff()
    {
        $countallrekammedis = rekam_medis::count();
        $countallreservasi = reservasi::count();
        $countallpasien = User::where('level','0')->count();
---
SELECT count(*) as aggregate FROM `users` WHERE `level` = '0'

    public function indexdokter()
    {
        $countallrekammedis = rekam_medis::count();
        $countallreservasi = reservasi::where('tgl_reservasi',date('Y-m-d'))->count();
        $countallpasien = User::where('level','0')->count();
---
SELECT count(*) as aggregate FROM `users` WHERE `level` = '0'