app/Http/Controllers/JadwalController.php

SELECT * FROM `jadwals` ORDER BY `tgl_jadwal` DESC LIMIT 5 offset 0
SELECT count(*) as aggregate FROM `jadwals`
---
    public function kelolajadwal()
    {
        $jadwal = jadwal::orderby('tgl_jadwal', 'desc')->paginate(5);

SELECT * FROM `jadwals` WHERE `tgl_jadwal` like '%0%' or `jam_masuk` Like '%0%' or `jam_pulang` Like '%0%' or `jumlah_maxpasien` Like '%0%'
---
    public function carijadwal()
    {
    if(request('cari-jadwal')==null){
        return;
    }
        $jadwal = jadwal::where('tgl_jadwal', 'like', '%' . request('cari-jadwal') . '%')
            ->orWhere('jam_masuk', 'Like', '%' . request('cari-jadwal') . '%')
            ->orWhere('jam_pulang', 'Like', '%' . request('cari-jadwal') . '%')
            ->orWhere('jumlah_maxpasien', 'Like', '%' . request('cari-jadwal') . '%')->get();