app/Http/Controllers/landing.php

SELECT count(*) as aggregate FROM `jadwals` WHERE `tgl_jadwal` = '2022-10-26' and `jumlah_maxpasien` > 0
---
    public function catch(Request $request)
    {
        $isi = $request->tgl;
        $jumlahjadwal = jadwal::where('tgl_jadwal', '=', $isi)->where('jumlah_maxpasien', '>', 0)->count();