app/Http/Controllers/RekamMedisController.php

SELECT `rekam_medis`.*, `users`.`name` FROM `rekam_medis` inner join `users` on `User_id` = `users`.`id` ORDER BY `rekam_medis`.`tgl_periksa` DESC LIMIT 5 offset 0
SELECT count(*) as aggregate FROM `rekam_medis` inner join `users` on `User_id` = `users`.`id`
---
    public function kelolarekammedis()
    {
        $rekam = rekam_medis::join('users','User_id','=','users.id')
        ->orderBy('rekam_medis.tgl_periksa','desc')->select('rekam_medis.*','users.name')->paginate(5);

UPDATE `rekam_medis` SET `nama_pasien` = 'Delia Ebert', `tgl_periksa` = '2014-06-03', `nama_penyakit` = 'consequatur', `kadar_gula_darah` = '27', `kadar_kolesterol` = '75', `kadar_asam_urat` = '35', `tekanan_darah` = '27', `alergi_makanan` = 'temporibus', `keterangan` = 'porro' WHERE `id_rekam_medis` = '7'
---
    public function editrekammedis()
    {
        DB::table('rekam_medis')
              ->where('id_rekam_medis', request('id_user'))
              ->update([
                'nama_pasien'=>request('nama_pasien'),
                "tgl_periksa" => request("tgl_periksa"),
                "nama_penyakit"=>request("nama_penyakit"),
                "kadar_gula_darah"=>request("kadar_gula_darah"),
                "kadar_kolesterol"=>request("kadar_kolesterol"),
                "kadar_asam_urat"=>request("kadar_asam_urat"),
                "tekanan_darah"=>request("tekanan_darah"),
                "alergi_makanan"=>request("alergi_makanan"),
                "keterangan"=>request("keterangan")

              ]);