app/Http/Controllers/ReservasiController.php

SELECT * FROM `reservasis` WHERE `user_id` = 12 ORDER BY `tgl_reservasi` DESC LIMIT 5 offset 0
SELECT count(*) as aggregate FROM `reservasis` WHERE `user_id` = 12
---
    public function reservasi()
    {
        $reservasi = reservasi::orderBy('tgl_reservasi', 'desc')->where('user_id', Auth::user()->id)->paginate(5);

SELECT * FROM `reservasis` WHERE `nama_pasien` like '%20%' or `tgl_reservasi` like '%20%' or `keluhan` like '%20%'
---
    public function carireservasi()
    {
        if(request('data')== null){
            return;
        }
        $data = reservasi::where('nama_pasien', 'like', '%' . request('data') . '%')
            ->orWhere('tgl_reservasi', 'like', '%' . request('data') . '%')
            ->orWhere('keluhan', 'like', '%' . request('data') . '%')->get();

SELECT * FROM `reservasis` WHERE `nama_pasien` like '%re%' or `tgl_reservasi` like '%re%' or `keluhan` like '%re%'
---
    public function carireservasipasien()
    {

        if(request('data')==null){
            return;
        }


        $data = reservasi::Where('nama_pasien', 'like', '%' . request('data') . '%')
        ->orWhere('tgl_reservasi', 'like', '%' . request('data') . '%')
        ->orWhere('keluhan', 'like', '%' . request('data') . '%')
        ->get();

SELECT * FROM `reservasis` ORDER BY `tgl_reservasi` ASC, `no_antrian` ASC LIMIT 5 offset 0
SELECT count(*) as aggregate FROM `reservasis`
---
    public function kelolareservasi()
    {
        $kelolareservasi = reservasi::orderBy('tgl_reservasi')->orderBy('no_antrian')->paginate(5);

SELECT * FROM `reservasis` WHERE `id_reservasi` = '8'
UPDATE `reservasis` SET `status_hadir` = '1', `reservasis`.`updated_at` = '2022-10-24 08:00:18' WHERE `id_reservasi` = '8'
---
    public function editreservasi(Request $req)
    {
        $reservasi = reservasi::where('id_reservasi', $req['id'])->get();
        if ($reservasi[0]->status_hadir == 1 && $req['status'] == 2) {
            $jadwal =  jadwal::where('tgl_jadwal', $req['tgl'])->get();
            jadwal::where('tgl_jadwal', $req['tgl'])->update(['jumlah_maxpasien' => $jadwal[0]->jumlah_maxpasien + 1]);
        } else if ($reservasi[0]->status_hadir == 2 && $req['status'] == 1) {
            $jadwal =  jadwal::where('tgl_jadwal', $req['tgl'])->get();
            jadwal::where('tgl_jadwal', $req['tgl'])->update(['jumlah_maxpasien' => $jadwal[0]->jumlah_maxpasien - 1]);
        }
        reservasi::where('id_reservasi', $req['id'])->update(['status_hadir' => $req['status']]);